#pragma once

// ------------------------------------------------------------------
// [서버/네트워크 설정]
// ------------------------------------------------------------------
#define SERVER_PORT 21001
#define BUFFER_SIZE RING_DEFAULT_SIZE
#define dfNETWORK_PACKET_CODE 0x89
#define NETWORK_PACKET_RECV_TIMEOUT 30

// ------------------------------------------------------------------
// [화면 이동 영역]
// ------------------------------------------------------------------
#define dfRANGE_MOVE_TOP    0
#define dfRANGE_MOVE_LEFT   0
#define dfRANGE_MOVE_RIGHT  6400
#define dfRANGE_MOVE_BOTTOM 6400

// ------------------------------------------------------------------
// [20ms 기준 이동량]
// ------------------------------------------------------------------
#define dfMOVE_X 3
#define dfMOVE_Y 2

// ------------------------------------------------------------------
// [이동 오차 체크 범위]
// ------------------------------------------------------------------
#define dfERROR_RANGE 50

// ------------------------------------------------------------------
// [공격 범위]
// ------------------------------------------------------------------
#define dfATTACK1_RANGE_X 80
#define dfATTACK2_RANGE_X 90
#define dfATTACK3_RANGE_X 100
#define dfATTACK1_RANGE_Y 10
#define dfATTACK2_RANGE_Y 10
#define dfATTACK3_RANGE_Y 20

// ------------------------------------------------------------------
// [공격 데미지]
// ------------------------------------------------------------------
#define dfATTACK1_DAMAGE 3
#define dfATTACK2_DAMAGE 4
#define dfATTACK3_DAMAGE 5

// ------------------------------------------------------------------
// [캐릭터 기본 설정]
// ------------------------------------------------------------------
#define MAX_HP          100
#define dfACTION_STOP   0xFF        // 이동하지 않는 상태
